TExley/STM32-Buoy/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2024 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "icm20948.h"
#include "string.h"
#include "stdio.h"
#include "stdlib.h"
#include "math.h"
#include "complex.h"
#include "nrf24.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
typedef enum print_option
{
	DONT_PRINT,
	PRINT
} print_option;

// The only sample rates where the accel and gyro are synchronized
typedef enum sample_rate
{
	SAMPLE_RATE_25_HZ = 1,
	SAMPLE_RATE_12_5_HZ = 2,
	SAMPLE_RATE_8_33_HZ = 3,
	SAMPLE_RATE_6_25_HZ = 4,
	SAMPLE_RATE_5_HZ = 5
} sample_rate;

typedef enum transmit_size
{
	SIZE_REQUIRED_DATA_ONLY = 5,
	SIZE_SPECTRA_DATA_ONLY = 9,
	SIZE_VALIDATION_DATA = 10, // required + 5 validation parameters
	SIZE_SPECTRA_DATA = 13, // required data + other 8 spectra data
	SIZE_ALL_DATA = 18,
} transmit_size;

// Result of packet transmission
typedef enum nRF24_TXResult {
	nRF24_TX_ERROR  = (uint8_t) 0x00, // Unknown error
	nRF24_TX_SUCCESS,                // Packet has been transmitted successfully
	nRF24_TX_TIMEOUT,                // It was timeout during packet transmit
	nRF24_TX_MAXRT                   // Transmit failed with maximum auto retransmit count
} nRF24_TXResult;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define MAXIMUM_PRINT_TIMEOUT (uint32_t) 100 // Maximum time-out to wait for any print ACK
#define MAX_PRINT_LENGTH 100 // Maximum lpuart1 serial data buffer length
#define NRF24_WAKE_DELAY (uint32_t) 100
#define TRANSMIT_DELAY (uint32_t) 25 // Delay between each transmit
#define TRANSMIT_TIMEOUT (uint32_t) 10000 // Maximum time-out to wait for nrf24 interrupt callback
#define TRANSMIT_SIZE (uint8_t) 32 // Number of bytes to send in one packet
#define TRANSMIT_PACKET_DATA_LIMIT (uint8_t) TRANSMIT_SIZE / sizeof(float) - 1 // Space for packet data - header
#define TRANSMIT_RETRYS (uint8_t) 5 // Number of times to wait and try to save packet
#define TRANSMIT_RETRY_DELAY (uint8_t) 500 // Delay between packet send attempts
#define GRAVITY 9.8
#define GYRO_SAMPLE_RATE_COEFFICIENT 44
#define GYRO_SAMPLE_RATE_MODIFIER 2 // Gyro samples amples twice as fast as accel
#define ACCEL_SAMPLE_RATE_COEFFICIENT 45
#define SAMPLE_RATE_BUFFER 5 // How many ms to wait after sampling before reading
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

UART_HandleTypeDef hlpuart1;

SPI_HandleTypeDef hspi1;

/* USER CODE BEGIN PV */
const uint16_t SAMPLE_SIZE = 1 << 4; // Must be = 2^n where n is an integer

const sample_rate SAMPLE_RATE = SAMPLE_RATE_12_5_HZ;
// Gyroscope sample rate = 1100 / (1 + value)
const uint8_t GYRO_SAMPLE_RATE_VALUE = SAMPLE_RATE * GYRO_SAMPLE_RATE_COEFFICIENT / GYRO_SAMPLE_RATE_MODIFIER - 1;
// Accelerometer sample rate = 1125 / (1 + value)
const uint8_t ACCEL_SAMPLE_RATE_VALUE = SAMPLE_RATE * ACCEL_SAMPLE_RATE_COEFFICIENT - 1;

// Gyroscope sample period = ((1 + value) / (1100s)) * (1000ms) / (1s)
const uint32_t GYRO_SAMPLE_PERIOD_MS = 10 * (GYRO_SAMPLE_RATE_VALUE + 1) / 11;
const uint32_t SAMPLE_PERIOD_MS = GYRO_SAMPLE_PERIOD_MS * GYRO_SAMPLE_RATE_MODIFIER;
const float SAMPLE_FREQUENCY = 1000.f / SAMPLE_PERIOD_MS;

// Gets added to measured gyro int16_vector3 via offset_gyro function
const int16_vector3 gyro_offset = { 0, -40, -79 }; // Measured for my specific device

const uint8_t GYRO_FS_SEL = 0; // 0 equivalent to GYRO_FS_SEL_250
// 131 is typical value for GYRO_FS_SEL = 0 (DS p11)
// 131 = 0xFFFF / 250 (lowest dps range of gyro)
const uint8_t GYRO_SENSITIVITY_DIVISOR = 1 << (GYRO_FS_SEL >> 1);
const float GYRO_SENSITIVITY_SCALE_FACTOR = M_PI / (180 * 131.f / GYRO_SENSITIVITY_DIVISOR);

const uint8_t ACCEL_FS_SEL = ACCEL_FS_SEL_4g; // 0 equivalent to ACCEL_FS_SEL_2g
// 16384 is typical value for ACCEL_FS_SEL = 0 (DS p11)
const float ACCEL_SENSITIVITY_SCALE_FACTOR = GRAVITY * 1.f / (16384 >> (ACCEL_FS_SEL >> 1));

// Outputs range from [-32752, 32752] and converts to equivalent values from [-4912, 4912]
// In magnetic flux density uT
const float MAG_SENSITIVITY_SCALE_FACTOR = 0.15;

// Number of times to repeat integrating (values should converge very quickly)
const uint8_t INTEGRAL_REPETITIONS = 2;

const float M_2PI = 2 * M_PI;
const float M_3PI2 = 3 * M_PI * 0.5f;
const float M_2PI_SAMPLE_SIZE = 2 * M_PI / SAMPLE_SIZE;
const float M_PI_SAMPLE_FREQUENCY = 1 / (SAMPLE_FREQUENCY * M_PI);

/** Earth-fixed local magnetic field in [uT]
 * https://www.ngdc.noaa.gov/geomag/calculators/magcalc.shtml#igrfwmm
 * For Santa Rosa CA with WMM model on 5/14/24
 */
const float BEY = 22.1544; // Uncertainty of .131uT and change of -0.0344uT/yr
const float BEZ = 42.1813; // Uncertainty of .157uT and change of -0.0981uT/yr

/** Magnetic delcination in [rad]
 * https://www.ngdc.noaa.gov/geomag/calculators/magcalc.shtml#declination
 * For Santa Rosa CA with WMM model on 5/14/24 with estimated 5 arcminute change west per year
 */
const float B_DECLINATION = 0.230674349; // 13 degrees 13 arcminutes east +- 22 arcminutes

/* These can be determined by spinning the buoy at constant rate so
 *  roll and pitch are both 0 and A can be determined by gyro then,
 *  Bi = Bi0 + (BEY*cosA)*Bi1 + (-BEY*sinA)*Bi2 and solve for Bij that minimize error
 * I can't, so I will instead align B1 to known compass headings to solve for Bij.
 * In python: Bijs = numpy.linalg.pinv(X)@Bi where X is the Nx3 matrix of Bij coefficients
 */
const float B10 = -2.21720753, // residual hull magnetic effect (bow) 0
    B11 = 1.09226593, // induced hull magnetic effect (bow) 1
    B12 = -0.12668346, // induced hull magnetic effect (bow) 0
    B20 = 8.57181184, // residual hull magnetic effect (starboard) 0
    B21 = 0.02056748, // induced hull magnetic effect (starboard) 0
    B22 = 1.07178173; // induced hull magnetic effect (starboard) 1

