TExley/STM32-Buoy/Src/main.c
const float B_delta = B11 * B22 - B12 * B21;

const uint8_t NRF24_ADDR[] = { 'B', 'o', 'y', '0', '1' }; // The TX address
const uint8_t NRF24_ADDR_SIZE = 5; // Must in the range 3 - 5
const uint8_t NRF24_CHANNEL = 1; // Transmits on the frequency of 2400Mhz + this
const uint8_t NRF24_HEADER_CHECK = 0b11111111;
const uint8_t NRF24_CHECK_BIT = 3;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_LPUART1_UART_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI1_Init(void);
void MX_USB_HOST_Process(void);

/* USER CODE BEGIN PFP */
HAL_StatusTypeDef device_init();
HAL_StatusTypeDef init_registers();
void serial_print(const char* buffer);
void offset_gyro(int16_vector3* gyro);
void measure_gyro_offset();
void fft(float complex* f, uint16_t size);
void integrate(float* f, float* df);
void collect_samples(int16_vector3* accel_samples, float* wx, float* wy, float* wz, float* bx, float* by, print_option option);
void integrate_w(float* roll, float* pitch, float* wx, float* wy, float* wz, print_option option);
void calculate_headings(float* zx, float* zy, float* roll, float* pitch, float* bx, float* by, print_option option);
void calculate_heave(float* heave, int16_vector3* accel_samples, float* roll, float* pitch, print_option option);
void co_spectral_density(float* c, float complex* x, float complex* y);
void quad_spectral_density(float* q, float complex* x, float complex* y);
nRF24_TXResult transmit_packet(uint8_t *pBuf, uint8_t length);
void transmit_data(float** data_outf, transmit_size data_outf_size, uint32_t data_col_start, uint32_t data_col_end);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
char str[MAX_PRINT_LENGTH];

transmit_size data_outf_size = SIZE_SPECTRA_DATA;
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void)
{
	/* USER CODE BEGIN 1 */

	/* USER CODE END 1 */

	/* MCU Configuration--------------------------------------------------------*/

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* USER CODE BEGIN Init */

	/* USER CODE END Init */

	/* Configure the system clock */
	SystemClock_Config();

	/* USER CODE BEGIN SysInit */

	/* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_LPUART1_UART_Init();
	MX_USB_HOST_Init();
	MX_I2C1_Init();
	MX_SPI1_Init();
	/* USER CODE BEGIN 2 */
	HAL_StatusTypeDef status = device_init();
	if (status != HAL_OK)
	{
		sprintf(str, "Device errored on startup.\r\nStatus = %d\r\n", status);
		serial_print(str);
		Error_Handler();
	}
	/* USER CODE END 2 */

	/* Infinite loop */
	/* USER CODE BEGIN WHILE */
	sprintf(str, "Accel scale: %.9f\r\nGyro scale: %.10f\n\rMag scale: %.2f\r\n", ACCEL_SENSITIVITY_SCALE_FACTOR,
	    GYRO_SENSITIVITY_SCALE_FACTOR, MAG_SENSITIVITY_SCALE_FACTOR);
	serial_print(str);

	sprintf(str, "Sample size: %u\r\n", SAMPLE_SIZE);
	serial_print(str);

	sprintf(str, "Sample rate: %lums, %.2f/s\r\n\r\n", SAMPLE_PERIOD_MS, SAMPLE_FREQUENCY);
	serial_print(str);

	while (1)
	{
		uint32_t timeit;

		/* DATA COLLECTION BEGIN */
		// Definitions
		int16_vector3* accel_samples = (int16_vector3*) malloc(sizeof(int16_vector3) * SAMPLE_SIZE);
		float* wx = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // gyro_samples.x in rad/s
		float* wy = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // gyro_samples.y in rad/s
		float* wz = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // gyro_samples.z in rad/s
		float* bx = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // mag_samples.x in uT
		float* by = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // mag_samples.y in uT

		// Body
		serial_print("Data collection starting.\r\n");
		uint32_t data_col_start = HAL_GetTick();
		collect_samples(accel_samples, wx, wy, wz, bx, by, DONT_PRINT);
		uint32_t data_col_end = HAL_GetTick();
		sprintf(str, "Data collection done in %lums.\r\n\r\n", data_col_end - data_col_start);
		serial_print(str);
		/* DATA COLLECTION END */


		/* ROLL PITCH CALCULATION BEGIN */
		// Definitions
		float* roll = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // Positive down from starboard
		float* pitch = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // Positive up from bow

		// Body
		serial_print("Roll/Pitch calculation starting.\r\n");
		timeit = HAL_GetTick();
		integrate_w(roll, pitch, wx, wy, wz, DONT_PRINT);
		timeit = HAL_GetTick() - timeit;
		sprintf(str, "Roll/Pitch calculation done in %lums.\r\n\r\n", timeit);
		serial_print(str);

		// Closing
		free(wx);
		free(wy);
		free(wz);
		/* ROLL PITCH CALCULATION END */


		/* HEAVE CALCULATION BEGIN */
		// Definitions
		float* heave = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // Earth-fixed reference

		// Body
		serial_print("Heave calculation starting.\r\n");
		timeit = HAL_GetTick();
		calculate_heave(heave, accel_samples, roll, pitch, DONT_PRINT);
		timeit = HAL_GetTick() - timeit;
		sprintf(str, "Heave calculation done in %lums.\r\n\r\n", timeit);
		serial_print(str);

		// Closing
		free(accel_samples);
		/* HEAVE CALCULATION END */


		/* NORTH AND EAST DECK SLOPE CALCULATION BEGIN */
		// Definitions
		float* zx = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // East deck slope
		float* zy = (float*) malloc(sizeof(float) * SAMPLE_SIZE); // North deck slope

		// Body
		serial_print("Deck slopes calculation starting.\r\n");
		timeit = HAL_GetTick();
		calculate_headings(zx, zy, roll, pitch, bx, by, DONT_PRINT);
		timeit = HAL_GetTick() - timeit;
		sprintf(str, "Heave calculation done in %lums\r\n\r\n", timeit);
		serial_print(str);

		// Closing
		free(bx);
		free(by);
		free(roll);
		free(pitch);
		/* NORTH AND EAST DECK SLOPE CALCULATION END */


		/* FFT ON RESULTS START */
		// Definitions
		float complex* heave_f = (float complex*) malloc(sizeof(float complex) * SAMPLE_SIZE); // // Earth-fixed heave wrt. freq.
		float complex* zx_f = (float complex*) malloc(sizeof(float complex) * SAMPLE_SIZE); // North deck slope wrt. freq.
		float complex* zy_f = (float complex*) malloc(sizeof(float complex) * SAMPLE_SIZE); // East deck slope wrt. freq.

