TExley/STM32-Buoy/Src/main.c
		// Body
		serial_print("FFT calculation starting.\r\n");
		timeit = HAL_GetTick();
		for (int i = 0; i < SAMPLE_SIZE; i++)
		{
			heave_f[i] = heave[i];
			zx_f[i] = zx[i];
			zy_f[i] = zy[i];
		}

		fft(heave_f, SAMPLE_SIZE);
		fft(zx_f, SAMPLE_SIZE);
		fft(zy_f, SAMPLE_SIZE);

		timeit = HAL_GetTick() - timeit;
		sprintf(str, "FFT calculation done in %lums\r\n\r\n", timeit);
		serial_print(str);

		// Closing
		free(heave);
		free(zx);
		free(zy);
		/* FFT ON RESULTS END */


		/* CO&QUAD-SPECTRAL DENSITY CALCULATION START */
		// Definitions 1
		float* C11, * C12, * C13, * C22, * C23, * C33, * Q12, * Q13, * Q23;
		C11 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		C12 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		C13 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		Q12 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		Q13 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);

		// Body 1
		serial_print("Spectral density calculation starting.\r\n");
		timeit = HAL_GetTick();

		co_spectral_density(C11, heave_f, heave_f);
		co_spectral_density(C12, heave_f, zx_f);
		co_spectral_density(C13, heave_f, zy_f);
		quad_spectral_density(Q12, heave_f, zx_f);
		quad_spectral_density(Q13, heave_f, zy_f);

		// Closing 1
		free(heave_f);

		// Definitions 2
		C22 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		C23 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		C33 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		Q23 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);

		// Body 2
		co_spectral_density(C22, zx_f, zx_f);
		co_spectral_density(C23, zx_f, zy_f);
		co_spectral_density(C33, zy_f, zy_f);
		quad_spectral_density(Q23, zx_f, zy_f);

		timeit = HAL_GetTick() - timeit;
		sprintf(str, "Spectral density calculation done in %lums\r\n\r\n", timeit);
		serial_print(str);

		// Closing 2
		free(zx_f);
		free(zy_f);
		/* CO&QUAD-SPECTRAL DENSITY CALCULATION END */


		/* CO&QUAD-SPECTRAL DENSITY ADJUSTMENTS END */
		// Definitions
		float p = 1;
		float* Q12p = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		float* Q13p = (float*) malloc(sizeof(float) * SAMPLE_SIZE);

		// Body
		serial_print("Spectral adjustment starting.\r\n");
		timeit = HAL_GetTick();
		for (int i = 0; i < SAMPLE_SIZE; i++)
		{
			Q12p[i] = Q12[i]*cosf(p) + C12[i]*sinf(p);
			Q13p[i] = Q13[i]*cosf(p) + C13[i]*sinf(p);
		}
		timeit = HAL_GetTick() - timeit;
		sprintf(str, "Spectral adjustment done in %lums\r\n\r\n", timeit);
		serial_print(str);
		/* CO&QUAD-SPECTRAL DENSITY ADJUSTMENTS END */


		/* MAIN PARAMETER CALCULATIONS START */
		// Definitions
		float* r1 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		float* a1 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		float* r2 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
		float* a2 = (float*) malloc(sizeof(float) * SAMPLE_SIZE);

		// Body
		serial_print("Main spectral parameter calculations starting.\r\n");
		timeit = HAL_GetTick();

		for (int i = 0; i < SAMPLE_SIZE; i++)
		{
			r1[i] = powf((Q12p[i] * Q12p[i] + Q13p[i] * Q13p[i]) / (C11[i] * (C22[i] + C33[i])), 0.5f);
			a1[i] = M_3PI2 - atan2f(Q13p[i], Q12p[i]);
			r2[i] = powf(powf(C22[i] - C33[i], 2) + 4 * C23[i] * C23[i], 0.5f) / (C22[i] + C33[i]);
			a2[i] = -M_3PI2 - 0.5f * atan2f(2 * C23[i], C22[i] - C33[i]); // + either 0 or pi...
			// ??? whichever makes the angle between a1 and a2 ???
		}

		timeit = HAL_GetTick() - timeit;
		sprintf(str, "Main spectral parameter calculations done in %lums\r\n\r\n", timeit);
		serial_print(str);

		// Closing
		free(Q12p);
		free(Q13p);
		/* MAIN PARAMETER CALCULATIONS END */


		/* TRANSMIT DATA START */
		// Definitions
		// NULL variables are possible future data validation terms
		// Designed this way to allow for future changes to data sent
		float* data_outf[SIZE_ALL_DATA] = {NULL, NULL, NULL, NULL, NULL, r1, a1, r2, a2, C11, C22, C33, C23, Q12, C12, Q13, C13, Q23};
		uint8_t data_outf_offset;
		if (data_outf_size == SIZE_VALIDATION_DATA || data_outf_size == SIZE_ALL_DATA)
			data_outf_offset = 0;
		else
			data_outf_offset = SIZE_VALIDATION_DATA - SIZE_REQUIRED_DATA_ONLY;

		// Body
		serial_print("Data transmission starting.\r\n");
		timeit = HAL_GetTick();
		transmit_data(data_outf + data_outf_offset, data_outf_size, data_col_start, data_col_end);
		timeit = HAL_GetTick() - timeit;
		sprintf(str, "Data transmission done in %lums\r\n\r\n", timeit);
		serial_print(str);

		// Closing
		free(C11);
		free(C12);
		free(C13);
		free(Q12);
		free(Q13);
		free(C22);
		free(C23);
		free(C33);
		free(Q23);
		free(r1);
		free(a1);
		free(r2);
		free(a2);
		/* TRANSMIT DATA END */

		/* USER CODE END WHILE */
		MX_USB_HOST_Process();

		/* USER CODE BEGIN 3 */
	}
	/* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void)
{
	RCC_OscInitTypeDef RCC_OscInitStruct = { 0 };
	RCC_ClkInitTypeDef RCC_ClkInitStruct = { 0 };

	/** Configure the main internal regulator output voltage
	 */
	if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
	{
		Error_Handler();
	}

	/** Configure LSE Drive Capability
	 */
	HAL_PWR_EnableBkUpAccess();
	__HAL_RCC_LSEDRIVE_CONFIG(RCC_LSEDRIVE_LOW);

	/** Initializes the RCC Oscillators according to the specified parameters
	 * in the RCC_OscInitTypeDef structure.
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_LSE | RCC_OSCILLATORTYPE_MSI;
	RCC_OscInitStruct.LSEState = RCC_LSE_ON;
	RCC_OscInitStruct.MSIState = RCC_MSI_ON;
	RCC_OscInitStruct.MSICalibrationValue = 0;
	RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_9;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
	RCC_OscInitStruct.PLL.PLLM = 5;
	RCC_OscInitStruct.PLL.PLLN = 71;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
	RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV6;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
		Error_Handler();
	}

	/** Initializes the CPU, AHB and APB buses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV4;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
	{
		Error_Handler();
	}

	/** Enable MSI Auto calibration
	 */
	HAL_RCCEx_EnableMSIPLLMode();
}

/**
 * @brief I2C1 Initialization Function
 * @param None
 * @retval None
 */
static void MX_I2C1_Init(void)
{

	/* USER CODE BEGIN I2C1_Init 0 */

	/* USER CODE END I2C1_Init 0 */

