TExley/STM32-Buoy/Src/main.c
	serial_print("Configuring nRF24.\r\n");
	nRF24_SetRFChannel(NRF24_CHANNEL); // set RF channel to 2424MHz
	nRF24_SetDataRate(nRF24_DR_1Mbps); // 1Mbit/s data rate
	nRF24_SetCRCScheme(nRF24_CRC_2byte); // 2-byte CRC scheme
	nRF24_SetAddrWidth(NRF24_ADDR_SIZE); // address width is 5 bytes
	nRF24_SetAddr(nRF24_PIPETX, NRF24_ADDR); // program TX address
	nRF24_SetAddr(nRF24_PIPE0, NRF24_ADDR); // program pipe#0 RX address, must be same as TX (for ACK packets)
	nRF24_SetTXPower(nRF24_TXPWR_0dBm); // configure TX power
	nRF24_SetAutoRetr(nRF24_ARD_500us, 10); // configure auto retransmit: 10 retransmissions with pause of 500s in between
	nRF24_EnableAA(nRF24_PIPE0); // enable Auto-ACK for pipe#0 (for ACK packets)
	nRF24_SetOperationalMode(nRF24_MODE_TX); // switch transceiver to the TX mode
	nRF24_SetPowerMode(nRF24_PWR_DOWN); // sleep transceiver
	serial_print("Configured.\r\n");

	return HAL_OK;
}

HAL_StatusTypeDef init_registers()
{
	HAL_StatusTypeDef status;

	status = ICM20948_WriteRegister(&REG_INT_PIN_CFG, FSYNC_INT_MODE_EN);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_FSYNC_CONFIG, EXT_SYNC_GYRO_XOUT_L | DELAY_TIME_EN);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_GYRO_SMPLRT_DIV, GYRO_SAMPLE_RATE_VALUE);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_GYRO_CONFIG_1, GYRO_FCHOICE | GYRO_DLPFCFG_6 | GYRO_FS_SEL);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_GYRO_CONFIG_2, GYRO_AVGCFG_128x);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_ACCEL_SMPLRT_DIV_2, ACCEL_SAMPLE_RATE_VALUE);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_ACCEL_CONFIG_1, ACCEL_FCHOICE | ACCEL_FS_SEL | ACCEL_DLPFCFG_7);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_ACCEL_CONFIG_2, DEC3_CFG_8);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_ODR_ALIGN_EN, ODR_ALIGN_EN);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_I2C_SLV0_CTRL, 0);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_I2C_SLV0_ADDR, AK09916_ADDR_READ);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_I2C_SLV0_REG, HXL);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_I2C_SLV4_ADDR, AK09916_ADDR_WRITE);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_I2C_SLV4_REG, CNTL2);
	if (status != HAL_OK)
		return status;

	status = ICM20948_WriteRegister(&REG_I2C_SLV4_DO, SINGLE_MEASURE);
	if (status != HAL_OK)
		return status;

	return ICM20948_Sleep();
}

void serial_print(const char* buffer)
{
	HAL_UART_Transmit(&hlpuart1, (uint8_t*) buffer, strlen(buffer), MAXIMUM_PRINT_TIMEOUT);
}

void offset_gyro(int16_vector3* gyro)
{
	gyro->x += gyro_offset.x;
	gyro->y += gyro_offset.y;
	gyro->z += gyro_offset.z;
}

void measure_gyro_offset()
{
	int16_vector3 gyro_off;

	serial_print("Measuring gyroscope offset. Keep device still.\r\n");

	if (ICM20948_MeasureGyroOffset((uint32_t) SAMPLE_SIZE, &gyro_off, SAMPLE_PERIOD_MS) != HAL_OK)
	{
		serial_print("Couldn't measure gyroscope offset.");
		Error_Handler();
	} else
	{
		sprintf(str, "Gyro Offset: %hd, %hd, %hd\r\n", gyro_off.x, gyro_off.y, gyro_off.z);
		serial_print(str);
	}
}

/*
 * Computes the fft of f and stores the result in f
 * size = 2^n where n is a positive non-zero integer
 */
void fft(float complex* f, uint16_t size)
{
	if (size == 2)
	{
		float complex F_even = f[0];
		f[0] = F_even + f[1];
		f[1] = F_even - f[1];
		return;
	}

	uint16_t size_half = size >> 1;

	// Compute even half of f
	float complex* F_even = (float complex*) malloc(sizeof(float complex) * size_half);
	for (uint16_t i = 0; i < size_half; i++)
		F_even[i] = f[2 * i];
	fft(F_even, size_half);

	// Compute odd half of f
	float complex* F_odd = (float complex*) malloc(sizeof(float complex) * size_half);
	for (uint16_t i = 0; i < size_half; i++)
		F_odd[i] = f[2 * i + 1];
	fft(F_odd, size_half);

	// f = fft(f)
	float complex w = cexpf(-M_2PI * I / size);
	for (uint16_t i = 0; i < size_half; i++)
	{
		float complex wi = cpowf(w, i) * F_odd[i];
		f[i] = F_even[i] + wi;
		f[i + size_half] = F_even[i] - wi;
	}
	free(F_even);
	free(F_odd);
}

/*
 * Populates f with the integral of df
 * f is defined to have an average of 0
 * f and df must be of length SAMPLE_SIZE
 */
void integrate(float* f, float* df)
{
	float complex* f_complex = (float complex*) malloc(sizeof(float complex) * SAMPLE_SIZE);
	for (int i = 0; i < SAMPLE_SIZE; i++)
		f_complex[i] = df[i];

	fft(f_complex, SAMPLE_SIZE);

	float* sinf_nk = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
	float* cosf_nk = (float*) malloc(sizeof(float) * SAMPLE_SIZE);

	// Undefined for first index
	float* f_real = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
	float* f_imag = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
	float* n_inv = (float*) malloc(sizeof(float) * SAMPLE_SIZE / 2);

	sinf_nk[0] = 0;
	cosf_nk[0] = 1;

	for (int i = 1; i < SAMPLE_SIZE; i++)
	{
		sinf_nk[i] = sinf(M_2PI_SAMPLE_SIZE * i);
		cosf_nk[i] = cosf(M_2PI_SAMPLE_SIZE * i);
		f_real[i] = crealf(f_complex[i]);
		f_imag[i] = cimagf(f_complex[i]);
		n_inv[i] = 1.f / i;
	}

	free(f_complex);

	float f_0 = crealf(f_complex[0]) * M_PI / SAMPLE_SIZE;

	long double sum = 0;

	for (int k = 0; k < SAMPLE_SIZE; k++)
	{
		f[k] = 0;
		uint16_t index = 0;
		for (int n = 1; n < SAMPLE_SIZE / 2; n++)
		{
			index += k;
			if (index >= SAMPLE_SIZE)
				index -= SAMPLE_SIZE;
			f[k] += (f_real[n] * sinf_nk[index] + f_imag[n] * cosf_nk[index]) * n_inv[n];
		}
		f[k] += f_0 * k;
		f[k] *= M_PI_SAMPLE_FREQUENCY;
		sum += f[k];
	}

	free(sinf_nk);
	free(cosf_nk);
	free(f_real);
	free(f_imag);
	free(n_inv);

	float average = sum / SAMPLE_SIZE;

	for (int i = 0; i < SAMPLE_SIZE; i++)
		f[i] -= average;
}

void collect_samples(int16_vector3* accel_samples, float* wx, float* wy, float* wz, float* bx, float* by, print_option option)
{
	int16_vector3* gyro_samples = (int16_vector3*) malloc(sizeof(int16_vector3) * SAMPLE_SIZE);
	int16_vector3* mag_samples = (int16_vector3*) malloc(sizeof(int16_vector3) * SAMPLE_SIZE);

