TExley/STM32-Buoy/Src/main.c
	ICM20948_Wake();

	// Find when gyro odr events happen
	float delay_ms;
	uint32_t fsync_time;
	do
	{
		// Send fsync event
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_SET);
		HAL_Delay(1);
		HAL_GPIO_WritePin(GPIOA, GPIO_PIN_3, GPIO_PIN_RESET);
		fsync_time = HAL_GetTick();

		HAL_Delay(GYRO_SAMPLE_PERIOD_MS);

		// Read delay between fsync event and gyro_odr
		uint8_t data[2];
		ICM20948_ReadRegisters(&REG_DELAY_TIMEH, data, 2);
		delay_ms = (data[0] * 256 + data[1]) * 0.0009645f;

	} while (delay_ms > 1);

	// Find when accel odr events happen
	HAL_Delay(SAMPLE_PERIOD_MS - (HAL_GetTick() - fsync_time) + SAMPLE_RATE_BUFFER);
	uint32_t start_time = HAL_GetTick();

	ICM20948_ReadAccelRegisters(accel_samples);

	HAL_Delay(GYRO_SAMPLE_PERIOD_MS + start_time - HAL_GetTick());
	start_time = HAL_GetTick();

	ICM20948_ReadAccelRegisters(accel_samples + 1);

	if (accel_samples[0].x != accel_samples[1].x)
		HAL_Delay(GYRO_SAMPLE_PERIOD_MS + start_time - HAL_GetTick());
	else
		HAL_Delay(SAMPLE_PERIOD_MS + start_time - HAL_GetTick());

	start_time = HAL_GetTick();
	ICM20948_WriteRegister(&REG_I2C_SLV4_CTRL, I2C_SLV_EN | I2C_SLV_LENG_1);

	for (uint16_t i = 0; i < SAMPLE_SIZE; i++)
	{
		HAL_Delay(GYRO_SAMPLE_PERIOD_MS + start_time - HAL_GetTick()); // Sample wait
		start_time = HAL_GetTick();

		// Set magnetometer to read sensor
		ICM20948_WriteRegister(&REG_I2C_SLV0_CTRL, I2C_SLV_EN | I2C_SLV_LENG_8);

		HAL_Delay(GYRO_SAMPLE_PERIOD_MS + start_time - HAL_GetTick()); // Read wait
		start_time = HAL_GetTick();

		// Read Sensors
		ICM20948_ReadAccelGryoRegisters(accel_samples + i, gyro_samples + i);
		ICM20948_ReadMagRegisters(mag_samples + i);

		// Set magnetometer to sample sensor
		ICM20948_WriteRegister(&REG_I2C_SLV4_CTRL, I2C_SLV_EN | I2C_SLV_LENG_1);
		ICM20948_WriteRegister(&REG_I2C_SLV0_CTRL, 0);
	}

	ICM20948_Sleep();

	for (uint16_t i = 0; i < SAMPLE_SIZE; i++)
	{
		// Manually corrects sensor and scales to rad/s
		offset_gyro(gyro_samples + i);

		// Standard aircraft roll, pitch, yaw directions
		// Roll is positive when starboard goes down
		// Pitch is positive when nose goes up
		// Yaw is positive when nose goes starboard
		wx[i] = gyro_samples[i].x * GYRO_SENSITIVITY_SCALE_FACTOR;
		wy[i] = -gyro_samples[i].y * GYRO_SENSITIVITY_SCALE_FACTOR;
		wz[i] = -gyro_samples[i].z * GYRO_SENSITIVITY_SCALE_FACTOR;

		// Converts to magnetic flux density [uT]
		bx[i] = mag_samples[i].x * MAG_SENSITIVITY_SCALE_FACTOR;
		by[i] = mag_samples[i].y * MAG_SENSITIVITY_SCALE_FACTOR;
	}

	if (option == PRINT)
	{
		serial_print("AccelX,\tAccelY,\tAccelZ,\tGyroX,\tGyroY,\tGyroZ,\tMagX,\tMagY,\tMagZ\r\n");
		for (int i = 0; i < SAMPLE_SIZE; i++)
		{
			sprintf(str, "%d,\t%d,\t%d,\t%d,\t%d,\t%d,\t%d,\t%d,\t%d\r\n", accel_samples[i].x, accel_samples[i].y,
			    accel_samples[i].z, gyro_samples[i].x, gyro_samples[i].y, gyro_samples[i].z, mag_samples[i].x, mag_samples[i].y,
			    mag_samples[i].z);
			serial_print(str);
		}
	}

	free(gyro_samples);
	free(mag_samples);
}

void integrate_w(float* roll, float* pitch, float* wx, float* wy, float* wz, print_option option)
{
	integrate(roll, wx);
	integrate(pitch, wy);

	float* droll = (float*) malloc(sizeof(float) * SAMPLE_SIZE);
	float* dpitch = (float*) malloc(sizeof(float) * SAMPLE_SIZE);

	for (uint8_t i = 0; i < INTEGRAL_REPETITIONS; i++)
	{
		for (int j = 0; j < SAMPLE_SIZE; j++)
		{
			droll[j] = wx[j] + tanf(pitch[j]) * (wy[j] * sinf(roll[j]) + wz[j] * cosf(roll[j]));
			dpitch[j] = wy[j] * cosf(roll[j]) - wz[j] * sinf(roll[j]);
		}

		integrate(roll, droll);
		integrate(pitch, dpitch);
	}

	free(droll);
	free(dpitch);

	if (option == PRINT)
	{
		serial_print("\r\nRoll,\t\tPitch,\t\tWx\t\tWy\t\tWz\r\n");
		for (int i = 0; i < SAMPLE_SIZE; i++)
		{
			sprintf(str, "%f,\t%f,\t%f,\t%f,\t%f\r\n", pitch[i] * 180 / M_PI, roll[i] * 180 / M_PI, wx[i], wy[i], wz[i]);
			serial_print(str);
		}
	}
}

void calculate_headings(float* zx, float* zy, float* roll, float* pitch, float* bx, float* by, print_option option)
{
	if (option == PRINT)
		serial_print("\r\nBx,\t\tBy,\t\tAzimuth\t\tEast Slope,\tNorth Slope\r\n");

	float B_cosD = cosf(B_DECLINATION);
	float B_sinD = sinf(B_DECLINATION);

	for (int i = 0; i < SAMPLE_SIZE; i++)
	{
		float cosP = cosf(pitch[i]);
		float sinP = sinf(pitch[i]);
		float cosR = cosf(roll[i]);
		float sinR = sinf(roll[i]);

		float D = BEY * B_delta * cosP * cosR;

		// Azimuth clockwise from magnetic north
		float sinA = ((B21 * cosP + B22 * sinP * sinR) * (bx[i] - B10) - (B11 * cosP - B12 * sinP * sinR) * (by[i] - B20)
		    - BEZ * B_delta * sinR) / D;
		float cosA = ((B22 * (bx[i] - B10) - B12 * (by[i] - B20)) * cosR - BEZ * B_delta * sinP * cosR) / D;

		// Recalculate for true-north azimuth
		float true_cosA = cosA * B_cosD - sinA * B_sinD;
		float true_sinA = sinA * B_cosD + cosA * B_sinD;

		zx[i] = sinP * true_sinA / cosP - sinR * true_cosA / (cosP * cosR);
		zy[i] = sinP * true_cosA / cosP + sinR * true_sinA / (cosP * cosR);

		if (option == PRINT)
		{
			sprintf(str, "%f,\t%f,\t%f,\t%f,\t%f\r\n", bx[i], by[i], atan2f(true_sinA, true_cosA) * 180 / M_PI, zx[i], zy[i]);
			serial_print(str);
		}
	}
}

void calculate_heave(float* heave, int16_vector3* accel_samples, float* roll, float* pitch, print_option option)
{
	if (option == PRINT)
		serial_print("roll,\t\tpitch\t\t,x,\t\ty,\t\tz,\t\theave\r\n");

	for (int i = 0; i < SAMPLE_SIZE; i++)
	{
		heave[i] = accel_samples[i].x * ACCEL_SENSITIVITY_SCALE_FACTOR * sinf(pitch[i]) * cosf(roll[i])
		    + accel_samples[i].y * ACCEL_SENSITIVITY_SCALE_FACTOR * cosf(pitch[i]) * sinf(roll[i])
		    + accel_samples[i].z * ACCEL_SENSITIVITY_SCALE_FACTOR * cosf(pitch[i]) * cosf(roll[i]);

		if (option == PRINT)
		{
			sprintf(str, "%f,\t%f,\t%f,\t%f,\t%f,\t%f\r\n", roll[i] * 180 / M_PI, pitch[i] * 180 / M_PI,
			    accel_samples[i].x * ACCEL_SENSITIVITY_SCALE_FACTOR, accel_samples[i].y * ACCEL_SENSITIVITY_SCALE_FACTOR,
			    accel_samples[i].z * ACCEL_SENSITIVITY_SCALE_FACTOR, heave[i]);
			serial_print(str);
		}
	}
}

