TExley/STM32-Buoy/Src/main.c
void co_spectral_density(float* c, float complex* x, float complex* y)
{
	for (int i = 0; i < SAMPLE_SIZE; i++)
		c[i] = 1000 * (crealf(x[i]) * crealf(y[i]) + cimagf(x[i]) * cimagf(y[i])) / (SAMPLE_SIZE * SAMPLE_PERIOD_MS);
}

void quad_spectral_density(float* q, float complex* x, float complex* y)
{
	for (int i = 0; i < SAMPLE_SIZE; i++)
		q[i] = 1000 * (cimagf(x[i]) * crealf(y[i]) - crealf(x[i]) * cimagf(y[i])) / (SAMPLE_SIZE * SAMPLE_PERIOD_MS);
}

// Function to transmit data packet
// input:
//   pBuf - pointer to the buffer with data to transmit
//   length - length of the data buffer in bytes
// return: one of nRF24_TX_xx values
nRF24_TXResult transmit_packet(uint8_t *pBuf, uint8_t length) {
	uint32_t start_time = HAL_GetTick();
	uint32_t end_time;
	uint8_t status;

	// Deassert the CE pin (in case if it still high)
	nRF24_CE_L;

	// Transfer a data from the specified buffer to the TX FIFO
	nRF24_WritePayload(pBuf, length);

	// Start a transmission by asserting CE pin (must be held at least 10us)
	nRF24_CE_H;

	// Poll the transceiver status register until one of the following flags will be set:
	//   TX_DS  - means the packet has been transmitted
	//   MAX_RT - means the maximum number of TX retransmits happened
	// note: this solution is far from perfect, better to use IRQ instead of polling the status
	do {
		status = nRF24_GetStatus();
		if (status & (nRF24_FLAG_TX_DS | nRF24_FLAG_MAX_RT)) {
			break;
		}
		end_time = HAL_GetTick() - start_time;
	} while (end_time < TRANSMIT_TIMEOUT);

	// Deassert the CE pin (Standby-II --> Standby-I)
	nRF24_CE_L;

	if (end_time >= TRANSMIT_TIMEOUT) {
		// Timeout
		return nRF24_TX_TIMEOUT;
	}

	// Clear pending IRQ flags
    nRF24_ClearIRQFlags();

	if (status & nRF24_FLAG_MAX_RT) {
		// Auto retransmit counter exceeds the programmed maximum limit (FIFO is not removed)
		return nRF24_TX_MAXRT;
	}

	if (status & nRF24_FLAG_TX_DS) {
		// Successful transmission
		return nRF24_TX_SUCCESS;
	}

	// Some banana happens, a payload remains in the TX FIFO, flush it
	nRF24_FlushTX();

	return nRF24_TX_ERROR;
}

/**
  * @brief  Transmits the data collected and processed to a listening transceiver.
  * @param  data_outf: a list of arrays to be transmitted
  * @param  data_outf_size: number of arrays in transmited data
  * @retval None
 */
void transmit_data(float** data_outf, transmit_size data_outf_size, uint32_t data_col_start, uint32_t data_col_end)
{
	nRF24_SetPowerMode(nRF24_PWR_UP);
	HAL_Delay(NRF24_WAKE_DELAY); // Using power ramp up time just to be safe
	nRF24_ClearIRQFlags(); // clear any pending IRQ flags

	uint8_t data_buffer[TRANSMIT_SIZE] = { 0 };

	// Create an initial message so the receiver can parse the received data
	data_buffer[0] = data_outf_size;
	memcpy(data_buffer + sizeof(uint8_t), &SAMPLE_SIZE, sizeof(uint16_t));
	data_buffer[NRF24_CHECK_BIT] = NRF24_HEADER_CHECK;
	memcpy(data_buffer + sizeof(uint32_t), &data_col_start, sizeof(uint32_t));
	memcpy(data_buffer + sizeof(uint32_t) * 2, &data_col_end, sizeof(uint32_t));
	uint32_t ctime = HAL_GetTick();
	memcpy(data_buffer + sizeof(uint32_t) * 3, &ctime, sizeof(uint32_t));
	// Bytes [16,32) are currently unused

	transmit_packet(data_buffer, TRANSMIT_SIZE);

	data_buffer[3] = 0; // Reset reserved byte 3

	HAL_Delay(TRANSMIT_TIMEOUT); // Make sure the  receiver had time to allocate space

	// Transmit packets of data for each array in data_outf_size
	for (uint8_t i = 0; i < data_outf_size; i++)
	{
		uint16_t n = 0; // first index of data_outf[i] for this packet
		do
		{
			uint8_t j = 0; // index offset for n
			do
			{
				// Converts float to uint32_t
				uint32_t *bits = (uint32_t *) &(data_outf[i][n + j]);
				j++; // dual purpose as a counter for floats in packets now

				// Copy float into data_buffer
				memcpy(data_buffer + sizeof(float) * j, bits, sizeof(float));

			// Limited to TRANSMIT_PACKET_DATA_LIMIT - 1 floats for extra header data
			} while (j < TRANSMIT_PACKET_DATA_LIMIT && j + n < SAMPLE_SIZE);

			// Add an additional header for packet where first 5 bits say which array
			// and last 3 bits say number of valid floats in packet
			data_buffer[0] = (i << 3) + j; // data_outf_size is at most 18 so only 5 bits are used for i

			// Next part of header is the index for the first float in packet
			memcpy(data_buffer + 1, &n, sizeof(uint16_t));

			// data_buffer[3] is reserved for first message
			HAL_Delay(TRANSMIT_DELAY);
			transmit_packet(data_buffer, TRANSMIT_SIZE);

			n += j; // Update n to first index of next packet's data
		} while (n < SAMPLE_SIZE);
		HAL_Delay(MAXIMUM_PRINT_TIMEOUT); // Give time for the receiver to print status message
	}

	HAL_Delay(TRANSMIT_TIMEOUT);

	nRF24_SetPowerMode(nRF24_PWR_DOWN);
}
/* USER CODE END 4 */

/**
 * @brief  This function is executed in case of error occurrence.
 * @retval None
 */
void Error_Handler(void)
{
	/* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	serial_print("ERROR :(");
	while (1)
	{
	}
	/* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
	/* User can add his own implementation to report the file name and line number,
		ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
	sprintf(str, "Wrong parameters value: file %s on line %d\r\n", file, line) */
	serial_print(str);
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
